Revit 2024 API
DisplacementElement.GetAdditionalElementsToDisplace Method
 Identify a set of elements that potentially should be displaced along with a given element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public static ICollection<ElementId> GetAdditionalElementsToDisplace(
	Document document,
	View view,
	ElementId idToDisplace
)
Visual Basic
Public Shared Function GetAdditionalElementsToDisplace ( _
	document As Document, _
	view As View, _
	idToDisplace As ElementId _
) As ICollection(Of ElementId)
Visual C++
public:
static ICollection<ElementId^>^ GetAdditionalElementsToDisplace(
	Document^ document,
	View^ view,
	ElementId^ idToDisplace
)
Parameters
document
Type: Autodesk.Revit.DB.Document
 the document
view
Type: Autodesk.Revit.DB.View
 the view
idToDisplace
Type: Autodesk.Revit.DB.ElementId
 element id of element to displace
Remarks
 For example, when a wall is displaced, any inserts or hosted elements should also be displaced.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
DisplacementElement Class
Autodesk.Revit.DB Namespace